#include QMK_KEYBOARD_H
#include "ariela.h"

#ifdef PROTOCOL_LUFA
    #include "lufa.h"
    #include "split_util.h"
#endif
#ifdef SSD1306OLED
    #include "ssd1306.h"
#endif

extern keymap_config_t keymap_config;

extern uint8_t is_master;

//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0
// カスタムキーコード定義
//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0
enum custom_keycodes {
    QWERTY = SAFE_RANGE,    // デフォルトレイヤー
    LOWER,                  // タップ時英数/ホールド時Lowerレイヤー切り替え
    RAISE,                  // タップ時かな/ホールド時Raiseレイヤー切り替え
    EISU,                   // 英数
    KANA                    // かな
};

//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0
// キーマップ定義
//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0
const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {
    /* Qwerty
     *,-----------------------------------------------------------.        ,-----------------------------------------------------------.
     *|   Tab   |    Q    |    W    |    E    |    R    |    T    |        |    Y    |    U    |    I    |    O    |    P    |   BkSp  |
     *|---------+---------+---------+---------+---------+---------|        |---------+---------+---------+---------+---------+---------|
     *|  Ctrl   |    A    |    S    |    D    |    F    |    G    |        |    H    |    J    |    K    |    L    |    ;    |    '    |
     *|---------+---------+---------+---------+---------+---------|        |---------+---------+---------+---------+---------+---------|
     *|  Shift  |    Z    |    X    |    C    |    V    |    B    |        |    N    |    M    |    ,    |    .    |    /    |  Enter  |
     *`-------------------+---------+---------+---------+---------|        |---------+---------+---------+---------+-------------------'
     *                    |   Alt   |   GUI   |  Lower  |  Space  |        |  Space  |  Raise  |  Shift  |   ESC   |
     *                    `---------+---------+---------+---------'        `---------+---------+---------+---------'
     */
    [_QWERTY] = LAYOUT_wrapper(
        KC_TAB  , ___________________QWERTY_L1___________________ ,          ___________________QWERTY_R1___________________ , KC_BSPC, \
        KC_LCTL , ___________________QWERTY_L2___________________ ,          ___________________QWERTY_R2___________________ , KC_QUOT, \
        KC_LSFT , ___________________QWERTY_L3___________________ ,          ___________________QWERTY_R3___________________ , KC_ENT , \
                            KC_LALT , KC_LGUI , LOWER   , KC_SPC  ,          KC_SPC  , RAISE   , KC_RSFT , KC_ESC
    ),

    /* Raise
     *,-----------------------------------------------------------.        ,-----------------------------------------------------------.
     *|    ~    |    !    |    @    |    #    |    $    |    %    |        |    ^    |    &    |    *    |    (    |    )    |    |    |
     *|---------+---------+---------+---------+---------+---------|        |---------+---------+---------+---------+---------+---------|
     *|         |    ^    |    &    |    *    |    (    |    )    |        |         |    _    |    +    |    {    |    }    |         |
     *|---------+---------+---------+---------+---------+---------|        |---------+---------+---------+---------+---------+---------|
     *|         |         |         |         |    _    |    {    |        |    }    |    +    |         |         |         |         |
     *`-------------------+---------+---------+---------+---------|        |---------+---------+---------+---------+-------------------'
     *                    |  VoUp   |  VoDn   |         |  EISU   |        |         |         |         |         |
     *                    `---------+---------+---------+---------'        `---------+---------+---------+---------'
     */
    [_RAISE] = LAYOUT_wrapper( \
        KC_TILD , ___________________RAISE__L1___________________ ,          ___________________RAISE__R1___________________ , KC_PIPE , \
        _______ , ___________________RAISE__L2___________________ ,          ___________________RAISE__R2___________________ , _______ , \
        _______ , _______ , _______ , _______ , KC_UNDS , KC_LCBR ,          KC_RCBR , KC_PLUS , _______ , _______ , _______ , _______ , \
                            KC_VOLU , KC_VOLD , _______ , EISU    ,          _______ , _______ , _______ , _______
    ),

    /* Lower
     * ,-----------------------------------------------------.        ,-----------------------------------------------------.
     * |   `    |   1    |   2    |   3    |   4    |   5    |        |    6   |    7   |    8   |    9   |    0   |    \   |
     * |--------+--------+--------+--------+--------+--------|        |--------+--------+--------+--------+--------+--------|
     * |        |   6    |   7    |   8    |   9    |   0    |        |        |    -   |    =   |    [   |    ]   |        |
     * |--------+--------+--------+--------+--------+--------|        |--------+--------+--------+--------+--------+--------|
     * |        |        |        |        |   -    |   [    |        |    ]   |    =   |        |        |        |        |
     * `-----------------+--------+--------+--------+--------|        |--------+--------+--------+--------+-----------------'
     *                   |  RST   |        |        |        |        |  KANA  |        |  BrUp  |  BrDn  |
     *                   `--------+--------+--------+--------'        `--------+--------+--------+--------'
     */
    [_LOWER] = LAYOUT_wrapper( \
        KC_GRV  , ___________________LOWER__L1___________________ ,          ___________________LOWER__R1___________________ , KC_BSLS , \
        _______ , ___________________LOWER__L2___________________ ,          ___________________LOWER__R2___________________ , _______ , \
        _______ , _______ , _______ , _______ , KC_MINS , KC_LBRC ,          KC_RBRC , KC_EQL  , _______ , _______ , _______ , _______ , \
                            RESET   , _______ , _______ , _______ ,          KANA    , _______ , KC_BRIU , KC_BRID
    ),

    /* Adjust
     *,-----------------------------------------------------------.        ,-----------------------------------------------------------.
     *|   F1    |   F2    |   F3    |   F4    |   F5    |   F6    |        |    F7   |    F8   |    F9   |   F10   |   F11   |   F12   |
     *|---------+---------+---------+---------+---------+---------|        |---------+---------+---------+---------+---------+---------|
     *|   F7    |   F8    |   F9    |   F10   |   F11   |   F12   |        |   LEFT  |   DOWN  |    UP   |  RIGHT  |         |         |
     *|---------+---------+---------+---------+---------+---------|        |---------+---------+---------+---------+---------+---------|
     *|         |         |         |         |         |         |        |         |         |         |         |         |         |
     *`-------------------+---------+---------+---------+---------|        |---------+---------+---------+---------+-------------------'
     *                    |         |         |         |         |        |         |         |         |         |
     *                    `---------+---------+---------+---------'        `---------+---------+---------+---------'
     */
    [_ADJUST] = LAYOUT_wrapper(
        ________________________ADJUST_L1________________________ ,          ________________________ADJUST_R1________________________ , \
        ________________________ADJUST_L2________________________ ,          ________________________ADJUST_R2________________________ , \
        _________________________________________________________ ,          _________________________________________________________ , \
                            _____________________________________ ,          _____________________________________
    ),

    /* LAYER
     *,-----------------------------------------------------------.        ,-----------------------------------------------------------.
     *|         |         |         |         |         |         |        |         |         |         |         |         |         |
     *|---------+---------+---------+---------+---------+---------|        |---------+---------+---------+---------+---------+---------|
     *|         |         |         |         |         |         |        |         |         |         |         |         |         |
     *|---------+---------+---------+---------+---------+---------|        |---------+---------+---------+---------+---------+---------|
     *|         |         |         |         |         |         |        |         |         |         |         |         |         |
     *`-------------------+---------+---------+---------+---------|        |---------+---------+---------+---------+-------------------'
     *                    |         |         |         |         |        |         |         |         |         |
     *                    `---------+---------+---------+---------'        `---------+---------+---------+---------'
     */
    /*
    [_LAYER] = LAYOUT(
        _______ , _______ , _______ , _______ , _______ , _______ ,          _______ , _______ , _______ , _______ , _______ , _______ , \
        _______ , _______ , _______ , _______ , _______ , _______ ,          _______ , _______ , _______ , _______ , _______ , _______ , \
        _______ , _______ , _______ , _______ , _______ , _______ ,          _______ , _______ , _______ , _______ , _______ , _______ , \
                            _______ , _______ , _______ , _______ ,          _______ , _______ , _______ , _______
    ),
    */
};

//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0
// 変数定義
//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0

static bool u_pressed_lower = false;
static bool u_pressed_raise = false;
static uint16_t u_pressed_lower_time = 0;
static uint16_t u_pressed_raise_time = 0;

//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0
// 関数定義
//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0

/**
 * キー処理実行時ユーザ定義
 */
bool process_record_user(uint16_t keycode, keyrecord_t *record) {
    bool result;
    if (record->event.pressed) {
        #ifdef SSD1306OLED
        set_keylog(keycode, record);
        #endif
        // set_timelog();
    }

    switch (keycode) {
        case QWERTY:
            if (record->event.pressed) {
                set_single_persistent_default_layer(_QWERTY);
            }
            return false;
            break;
        case LOWER:
            result = change_layer_onpress_with_tap_and_trilayer(_LOWER, KC_LANG2, record, &u_pressed_lower, &u_pressed_lower_time, _LOWER, _RAISE, _ADJUST);
            if (record->event.pressed) {
                // 他のキーのタップ機能を停止させる
                u_pressed_raise = false; 
            }
            return result;
            break;
        case RAISE:
            result = change_layer_onpress_with_tap_and_trilayer(_RAISE, KC_LANG1, record, &u_pressed_raise, &u_pressed_raise_time, _LOWER, _RAISE, _ADJUST);
            if (record->event.pressed) {
                // 他のキーのタップ機能を停止させる
                u_pressed_lower = false;
            }
            return result;
            break;
        case EISU:
            return lang_key_onpress(KC_LANG2, record);
            break;
        case KANA:
            return lang_key_onpress(KC_LANG1, record);
            break;
        default:
            if (record->event.pressed) {
                // タップ対応キーと他のキーが同時押しされた場合はタップ機能を停止させる
                u_pressed_lower = false;
                u_pressed_raise = false;
            }
            break;
    }
  
    // キー入力パススルー
    return true;
}

//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0
// OLED関連関数定義
//--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+----8----+----9----+----0

/**
 * マトリクス初期化時ユーザ定義
 */
void matrix_init_user(void) {
    //SSD1306 OLED init, make sure to add #define SSD1306OLED in config.h
    #ifdef SSD1306OLED
        iota_gfx_init(!has_usb());   // turns on the display
    #endif
}

//SSD1306 OLED update loop, make sure to add #define SSD1306OLED in config.h
#ifdef SSD1306OLED

// When add source files to SRC in rules.mk, you can use functions.
const char *read_layer_state(void);
const char *read_logo(void);
void set_keylog(uint16_t keycode, keyrecord_t *record);
const char *read_keylog(void);
const char *read_keylogs(void);

// const char *read_mode_icon(bool swap);
// const char *read_host_led_state(void);
// void set_timelog(void);
// const char *read_timelog(void);

/**
 * マトリクススキャン時ユーザ定義
 */
void matrix_scan_user(void) {
    iota_gfx_task();
}

void matrix_render_user(struct CharacterMatrix *matrix) {
    if (is_master) {
        // If you want to change the display of OLED, you need to change here
        matrix_write_ln(matrix, read_layer_state());
        matrix_write_ln(matrix, read_keylog());
        matrix_write_ln(matrix, read_keylogs());
        //matrix_write_ln(matrix, read_mode_icon(keymap_config.swap_lalt_lgui));
        //matrix_write_ln(matrix, read_host_led_state());
        //matrix_write_ln(matrix, read_timelog());
    } else {
        matrix_write(matrix, read_logo());
    }
}

void matrix_update(struct CharacterMatrix *dest, const struct CharacterMatrix *source) {
    if (memcmp(dest->display, source->display, sizeof(dest->display))) {
        memcpy(dest->display, source->display, sizeof(dest->display));
        dest->dirty = true;
    }
}

void iota_gfx_task_user(void) {
    struct CharacterMatrix matrix;
    matrix_clear(&matrix);
    matrix_render_user(&matrix);
    matrix_update(&display, &matrix);
}

#endif//SSD1306OLED
